content/wiki/intro-esp.md
+++
title = "Introduction to Spanish"
author = ["Zhenkai Weng"]
date = 2020-08-30
tags = ["usage"]
draft = false
toc = true
+++

<div class="OPTIONS">
  <div></div>



</div>

Welcome to the ESP Spanish Wiki! Here's some _essential_ knowledge to kick-start your Spanish learning journey! The first lesson is fairly long, so feel free to take breaks in between.  


## Gender {#gender}

Spanish nouns have gender. Usually, nouns ending in -o are masculine, like _nacho_, and words ending in -a are feminine like _agua_. This is a general pattern and you will see many exceptions to it. Other patterns will emerge as you learn more Spanish. Be mindful of this pattern as you go.  


## Article {#article}

The word "the" in Spanish has two forms: _el_ and _la_. The former is used on masculine nouns (e.g. _el profesor_), and the latter on feminine nouns (e.g. _la profesora_). However, when the word begins with a stressed "a" sound, you use _el_ instead of _la_ on singular feminine nouns (e.g. _el agua_ instead of _la agua_; _las aguas_ stay the same).  


## Subject Pronouns {#subject-pronouns}

Instead of nouns, you can use _subject pronouns_ as the subject of an action. For example, you can say _He ate the apple_ instead of _The trainee ate the apple_. Here is a list of pronouns in Spanish.  

| Category                 | Singular            | Plural                  |
|--------------------------|---------------------|-------------------------|
| First person             | yo = I              | nosotros, nosotras = we |
| Second person (informal) | tú (informal) = you | vosotros = you          |
| Second person (formal)   | usted (Ud.) = you   | ustedes (Uds.) = you    |
| Third person             | él = he, ella = she | ellos, ellas = they     |

-   Spanish has two different words for "you" based on your familiarity with whomever you are talking to. If you are talking to your friend, family member, or someone younger than you, use _tú_. If you are talking to a stranger or an elder, for example, you should use _usted_ to show respect.
-   Note that subject pronouns ending in -a or -as applies to female(s) only! For example, you can only use _ellas_ on a group of women but you need to use _ellos_ when there are men in the group.


## Verb conjugation {#verb-conjugation}

Like many other languages, you need to conjugate a verb from its _infinitive form_ (e.g. _to swim_ in English or _nadar_ in Spanish) in order to use it (e.g. _he swims_ in English and _él nada_ in Spanish). How you conjugate the verb depends on the subject pronoun that is appropriate for the person taking the action. There are 6 classes of verbs
